/**
 * 
 */
define([], function() {
	var FontConf = {};

	FontConf.FONT_FAMILIES = {
			"宋体" : "宋体",
			"黑体" : "黑体",
			"幼圆" : "幼圆",
			"微软雅黑" : "微软雅黑",
			"隶书" : "隶书",
			"楷体" : "楷体",
			"仿宋" : "仿宋",
			"新宋体" : "新宋体",
			"Arial,宋体" : "Arial",
			"Cambria,宋体" : "Cambria",
			"Times New Roman,宋体" : "Times New Roman",

			"DreamerOne,宋体" : "DreamerOne",
			"方正舒体" : "方正舒体",
			"方正姚体" : "方正姚体",
			"华文彩云" : "华文彩云",
			"华文仿宋" : "华文仿宋",
			"华文细黑" : "华文细黑",
			"华文行楷" : "华文行楷",
			"华文新魏" : "华文新魏",
			"华文中宋" : "华文中宋",
			"叶根友毛笔行书简体" : "叶根友毛笔行书简体",
			"微软简行楷" : "微软简行楷",
			"方正剪纸简体" : "方正剪纸简体",
			"方正大黑简体" : "方正大黑简体",
			"方正粗圆简体" : "方正粗圆简体",
			"方正粗宋简体" : "方正粗宋简体",
			"汉仪大宋简" : "汉仪大宋简",
			"汉仪太极体简" : "汉仪太极体简",
			"方正汉真广标简体" : "方正汉真广标简体"
	};

	FontConf.FONT_SIZES = [ 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 36,
					48, 72 ];

	FontConf.ALIGNMENTS = {
				"start" : "居左",
				"middle" : "居中",
				"end" : "居右"
	};
	
	return FontConf;
});