/**
 * 
 */
define([], function() {
	var FontConf = {};

	FontConf.FONT_FAMILIES = {
			"" : "",
		    "Arial" : "Arial",
		    "Impact" : "Impact",
		    "宋体":"宋体",   
			"黑体" :"黑体",
			"幼圆" :"幼圆",
			"微软雅黑" :"微软雅黑",
			"隶书" :"隶书",
			"楷体" :"楷体",
			"仿宋" :"仿宋",
			"新宋体" :"新宋体",
			"华文彩云" :"华文彩云",
			"华文仿宋" :"华文仿宋",
			"华文细黑" :"华文细黑",
			"华文行楷" :"华文行楷",
			"华文新魏" :"华文新魏",
			"华文中宋" :"华文中宋",
			"方正舒体" :"方正舒体",
			"方正姚体" :"方正姚体",
			"方正黑体简体":"方正黑体简体",
			"方正楷体简体":"方正楷体简体",
			"方正兰亭黑简体":"方正兰亭黑简体",
			"方正正中黑简体":"方正正中黑简体",
			"方正汉真广标简体":"方正汉真广标简体",
			"方正卡通简体":"方正卡通简体",
			"方正小标宋简体":"方正小标宋简体",
			"方正正黑简体":"方正正黑简体",
			"方正综艺简体":"方正综艺简体",
			"方正大黑简体":"方正大黑简体",
	};

	FontConf.FONT_SIZES = [ 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 36,
					48, 72 ];	
	
	return FontConf;
});